os/ref.html
<!DOCTYPE html>
<html>
<head>
<!-- 2018-02-25 Sun 11:37 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>《操作系统原理》教材及参考资料</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="王晓林">
<link rel="stylesheet" href="http://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">

</head>
<body>
<div id="content">
<h1 class="title">《操作系统原理》教材及参考资料</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">教材</a>
<ul>
<li><a href="#orgheadline2">购买建议</a></li>
</ul>
</li>
<li><a href="#orgheadline3">参考资料</a>
<ul>
<li><a href="#orgheadline4">More Web Resources</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">教材</h2>
<div class="outline-text-2" id="text-orgheadline1">
<ol class="org-ol">
<li>A.S. Tanenbaum. <a href="https://cs3.swfu.edu.cn/tech#book_id=4&amp;library_id=Calibre1&amp;panel=book_details"><i>Modern Operating Systems</i></a>. Pearson Prentice Hall, 3<sup>rd</sup>
     edition, 2008.
<ul class="org-ul">
<li><a href="http://lib.swfu.edu.cn">图书馆</a> 中英文版都有</li>
<li><a href="https://www.pearson.com/us/higher-education/program/Tanenbaum-Modern-Operating-Systems-4th-Edition/PGM80736.html">配套网站</a></li>
</ul></li>
<li>Silberschatz, Galvin, and Gagne. <a href="https://cs3.swfu.edu.cn/tech#book_id=1&amp;library_id=Calibre1&amp;panel=book_details"><i>Operating System Concepts Essentials</i></a>. John Wiley &amp;
Sons, 2011.
<ul class="org-ul">
<li><a href="http://lib.swfu.edu.cn">图书馆</a> 中英文版都有；</li>
<li>配套网站：<a href="http://www.os-book.com">http://www.os-book.com</a>;</li>
<li>这本也可以: Silberschatz, Galvin, and Gagne. <a href="http://cs2.swfu.edu.cn/pub/resources/Books/OS/os-concepts-8e/Operating_System_Concepts_With_Java-8e.pdf"><i>Operating System Concepts With
Java</i></a>. John Wiley &amp; Sons, 8<sup>th</sup> edition, 2010.</li>
</ul></li>
<li>Bryant, Randal E. and O'Hallaron, David R. <a href="https://cs3.swfu.edu.cn/tech#book_id=33&amp;library_id=Calibre1&amp;panel=book_details"><i>Computer Systems: A Programmer's
Perspective</i></a>. Addison-Wesley, 2<sup>nd</sup> edition, 2010.</li>
<li>D.P. Bovet and M. Cesatí. <a href="https://cs3.swfu.edu.cn/tech#book_id=11&amp;library_id=Calibre1&amp;panel=book_details"><i>Understanding The Linux Kernel. O'Reilly</i></a>, 3<sup>rd</sup>
     edition, 2005.</li>
<li>M.J. Bach. <a href="https://cs3.swfu.edu.cn/tech#book_id=8&amp;library_id=Calibre1&amp;panel=book_details"><i>The design of the UNIX operating system</i></a>. Prentice-Hall software
series. Prentice-Hall, 1986.</li>
<li>邹恒明. <a href="https://cs3.swfu.edu.cn/tech#book_id=82&amp;library_id=Calibre1&amp;panel=book_details"><i>《计算机的心智：操作系统之哲学原理》</i></a>. 机械工业出版社, 2009.</li>
<li>新设计团队. <a href="https://cs3.swfu.edu.cn/tech/get/PDF/14/Calibre1"><i>Linux内核设计的艺术</i></a>, 机械工业出版社, 2013.</li>
<li>郑钢. <a href="https://cs3.swfu.edu.cn/tech/get/PDF/158/Calibre1"><i>操作系统真象还原</i></a>, 人民邮电出版社, 2016.</li>
<li>于渊， <a href="https://cs3.swfu.edu.cn/tech#book_id=2&amp;library_id=Calibre1&amp;panel=book_details"><i>《Orange'S：一个操作系统的实现》</i></a>. 电子工业出版社, 2009.</li>
<li>川合秀实，<a href="https://cs3.swfu.edu.cn/tech#book_id=3&amp;library_id=Calibre1&amp;panel=book_details"><i>《30天自制操作系统》</i></a>，人民邮电出版社，2012.8.
<ul class="org-ul">
<li>参考链接：
<ul class="org-ul">
<li><a href="https://code.google.com/p/osask/">https://code.google.com/p/osask/</a></li>
<li><a href="https://github.com/Tassandar/OSASK">https://github.com/Tassandar/OSASK</a></li>
<li><a href="https://github.com/fakefish/OSASK">https://github.com/fakefish/OSASK</a></li>
</ul></li>
</ul></li>
</ol>
</div>
<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2">购买建议</h3>
<div class="outline-text-3" id="text-orgheadline2">
<p>
首先, 我鼓励大家尽量节俭, 尽量去图书馆借书, 尽量多查阅网上资料. 如果真的有志于操作系统研究, 那么, 如果我是你, 我会先买:
</p>
<ol class="org-ol">
<li>A.S. Tanenbaum. <a href="https://cs3.swfu.edu.cn/tech#book_id=4&amp;library_id=Calibre1&amp;panel=book_details"><i>Modern Operating Systems</i></a>. Pearson Prentice Hall, 3<sup>rd</sup>
      edition, 2008. (《现代操作系统》第三版)</li>
<li>新设计团队. <a href="https://cs3.swfu.edu.cn/tech/get/PDF/14/Calibre1"><i>Linux内核设计的艺术</i></a>, 机械工业出版社, 2013.</li>
<li>郑钢. <a href="https://cs3.swfu.edu.cn/tech/get/PDF/158/Calibre1"><i>操作系统真象还原</i></a>, 人民邮电出版社, 2016.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">参考资料</h2>
<div class="outline-text-2" id="text-orgheadline3">
<ul class="org-ul">
<li>xv6: <a href="https://pdos.csail.mit.edu/6.828/2017/xv6.html">https://pdos.csail.mit.edu/6.828/2017/xv6.html</a></li>
<li>Wikipedia: <a href="https://en.wikipedia.org/wiki/Category:Operating_systems">https://en.wikipedia.org/wiki/Category:Operating_systems</a></li>
<li><a href="https://cs3.swfu.edu.cn/tech">https://cs3.swfu.edu.cn/tech</a></li>
</ul>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">More Web Resources</h3>
<div class="outline-text-3" id="text-orgheadline4">
<ul class="org-ul">
<li><a href="http://www.ibm.com/developerworks/">http://www.ibm.com/developerworks/</a>
<ul class="org-ul">
<li><a href="http://www.ibm.com/developerworks/linux/library/l-linuxboot/">Inside the Linux boot process</a></li>
<li><a href="http://www.ibm.com/developerworks/linux/library/l-system-calls/">Kernel command using Linux system calls</a></li>
<li><a href="http://www.ibm.com/developerworks/linux/library/l-linux-filesystem/">Anatomy of the Linux file system</a></li>
<li><a href="http://www.ibm.com/developerworks/linux/library/l-proc.html">Access the Linux kernel using the /proc filesystem</a></li>
</ul></li>
<li><a href="http://duartes.org/gustavo/blog/">http://duartes.org/gustavo/blog/</a>
<ul class="org-ul">
<li><a href="http://duartes.org/gustavo/blog/post/motherboard-chipsets-memory-map">Motherboard Chipsets and the Memory Map</a></li>
<li><a href="http://duartes.org/gustavo/blog/category/software-illustrated/page/2">How Computers Boot Up</a></li>
<li><a href="http://duartes.org/gustavo/blog/post/anatomy-of-a-program-in-memory">Anatomy of a Program in Memory</a></li>
<li><a href="http://duartes.org/gustavo/blog/post/how-the-kernel-manages-your-memory">How The Kernel Manages Your Memory</a></li>
<li><a href="http://duartes.org/gustavo/blog/post/getting-physical-with-memory">Getting Physical With Memory</a></li>
<li><a href="http://duartes.org/gustavo/blog/post/intel-cpu-caches">Cache: a place for concealment and safekeeping</a></li>
</ul></li>
<li><a href="http://people.redhat.com/drepper/cpumemory.pdf">What every programmer should know about memory</a></li>
<li><a href="http://www.cs.rochester.edu/~sandhya/csc256/">http://www.cs.rochester.edu/~sandhya/csc256/</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: 王晓林</p>
<p class="date">Created: 2018-02-25 Sun 11:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>